// --створити масив з:
// - з 5 числових значень

let numbers = [1, 2, 3, 4, 5];
console.log(numbers);
// - з 5 стічкових значень

let colors = ['green', 'red', 'blue', 'grey', 'black'];
console.log(colors);
// - з 5 значень стрічкового, числового та булевого типу

let arr = [25, true, 'yes', 42, 'ok'];
console.log(arr);
// - та вивести його в консоль

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

let smartphones = [];

smartphones[0] = 'samsung';
smartphones[1] = 'nokia';
smartphones[2] = 'iphone';

console.log(smartphones);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

for (let i = 1; i <= 10; i++) {
    document.write('<div>Hello</div>');

}

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

for (let i = 1; i <= 10; i++) {
    document.write(`<div>${i} hundred</div>`);

}

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
let h1 = 0;
while (h1 < 20) {
    document.write('<h1>Hello my friend</h1>');
    h1++;
}
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
let h2 = 1;
while (h2 <= 20) {
    document.write(`<h1> Hello my friend number ${h2}</h1>`);
    h2++;
}

console.log('----------------------------------------------------------------------------------------------');
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

let numbers2 = [1, 4, 2, 7, 3, 9, 4, 5, 8, 5];

for (let i = 0; i < numbers2.length; i++) {
    console.log(numbers2[i]);

}
console.log('----------------------------------------------------------------------------------------------');
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

let str = ['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine', 'ten'];

for (let i = 0; i < str.length; i++) {
    console.log(str[i]);

}

console.log('----------------------------------------------------------------------------------------------');
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

let mixed = [1, 'two', 3, 'four', true, 'six', false, 9, 'nine', true];

for (const mix of mixed) {
    console.log(mix);
}


console.log('----------------------------------------------------------------------------------------------');
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

for (let i = 0; i < mixed.length; i++) {
    if (typeof(mixed[i]) === 'boolean')
        console.log(typeof(mixed[i]));
}

for (let i = 0; i < mixed.length; i++) {
    if (typeof(mixed[i]) === 'number')
        console.log(typeof(mixed[i]));
}

for (let i = 0; i < mixed.length; i++) {
    if (typeof(mixed[i]) === 'string')
        console.log(typeof(mixed[i]));
}

console.log('----------------------------------------------------------------------------------------------');
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.

let arr2 = [];

arr2[0] = false;
arr2[1] = 'apple';
arr2[2] = 42;
arr2[3] = true;
arr2[4] = null;
arr2[5] = "12";
arr2[6] = undefined;
arr2[7] = 21;
arr2[8] = 'cherry';
arr2[9] = 'banana';


for (let i = 0; i < arr2.length; i++) {
    console.log(arr2[i]);
}

console.log('----------------------------------------------------------------------------------------------');
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

for (let i = 1; i <= 10; i++) {
    const step = 'крок: ' + i;
    console.log(step);
    document.write(step + '<br>');

}

console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

for (let i = 1; i <= 100; i++) {
    const step = 'крок: ' + i;
    console.log(step);
    document.write(step, '<br>');

}

console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
let stepTwo = 1;
for (let i = 1; i <= 100; i++) {
    const step = `крок ${i}: `;
    console.log(step, stepTwo);
    document.write(step, stepTwo, '<br>');
    stepTwo += 2;
}

console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

for (let i = 1; i <= 100; i++) {

    if (i % 2 === 0) {
        const step = 'парний крок: ' + i;
        console.log(step);
        document.write(step, '<br>');
    }

}
console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

for (let i = 1; i <= 100; i += 2) {


    const step = 'непарний крок: ' + i;
    console.log(step);
    document.write(step, '<br>');


}

// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди) 

for (let i = 0; i < 2; i++) {
    for (let j = 0; j < 60; j++) {
        console.log('хвилин ', i, ' : ', 'секунд ', j);
        document.write('хвилин ', i, ' : ', 'секунд ', j, '<br>');
    }

}

console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');
// - Відтворити роботу годинника, відрахувавши  2 години  (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)

for (let i = 0; i < 2; i++) {
    for (let j = 0; j < 60; j++) {
        for (let k = 0; k < 60; k++) {
            //document.write('годин ', i, ' : ', 'хвилин ', j, ' : ', 'секунд ', k, '<br>');
            //console.log('годин ', i, ' : ', 'хвилин ', j, ' : ', 'секунд ',);
        }

    }

}

console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');

// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.

let abc = ['a', 'b', 'c'];
let strAbc = '';
for (let i = 0; i < abc.length; i++) {
    strAbc = strAbc + abc[i];
}

console.log(strAbc);

console.log('----------------------------------------------------------------------------------------------');
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.

let strAbc2 = '';
let i = 0;

while (i < abc.length) {
    strAbc2 = strAbc2 + abc[i];
    i++;
}
console.log(strAbc2);
console.log('----------------------------------------------------------------------------------------------');

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
let strAbc3 = '';
for (const a of abc) {
    strAbc3 = strAbc3 + a;
}

console.log(strAbc3);
console.log('----------------------------------------------------------------------------------------------');
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for in зібрати всі букви в слово.

let strAbc4 = '';
for (const i in abc) {
    strAbc4 = strAbc4 + abc[i];

}

console.log(strAbc4);
console.log('----------------------------------------------------------------------------------------------');

// =================
// =================
// =================
// =================

// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.


// ============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.


// 1
//  створити пустий масив та :
// 1. заповнити його 50 парними числами за допомоги циклу.
// 2. заповнити його 50 непарними числами за допомоги циклу.
// 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
//  2. вывести на консоль  каждый третий елемент
//  3. вывести на консоль  каждый третий елемент
//  но при условии что его значение является парным.
//  4. вывести на консоль  каждый третий елемент
//  но при условии что он имеет парное значение и
//  записать их в другой массив.
//  5. Вывести каждый елемент массива у которого соседний с права элемент - парный
//   5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.

// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
//  додати його в інший масив.






// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
/*
let minutes = 0;
let seconds = 0;

for (let i = 0; i <= 59; i++) {
    seconds = seconds + 1;

    console.log(seconds + ' seconds');
}

for (let j = 1; j <= 2; j++) {

    if (seconds = 60) {
        minutes = minutes + j;
        seconds = 0;
    }
    console.log(minutes + ' minutes');
}

*/