// --створити масив з:
// - з 5 числових значень

let numbers = [1, 2, 3, 4, 5];
console.log(numbers);
// - з 5 стічкових значень

let colors = ['green', 'red', 'blue', 'grey', 'black'];
console.log(colors);
// - з 5 значень стрічкового, числового та булевого типу

let arr = [25, true, 'yes', 42, 'ok'];
console.log(arr);
// - та вивести його в консоль

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

let smartphones = [];

smartphones[0] = 'samsung';
smartphones[1] = 'nokia';
smartphones[2] = 'iphone';

console.log(smartphones);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

for (let i = 1; i <= 10; i++) {
    document.write('<div>Hello</div>');

}

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

for (let i = 1; i <= 10; i++) {
    document.write(`<div>${i} hundred</div>`);

}

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
let h1 = 0;
while (h1 < 20) {
    document.write('<h1>Hello my friend</h1>');
    h1++;
}
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
h1 = 1;
while (h1 <= 20) {
    document.write(`<h1> Hello my friend number ${h1}</h1>`);
    h1++;
}

console.log('----------------------------------------------------------------------------------------------');
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

numbers = [1, 4, 2, 7, 3, 9, 4, 5, 8, 5];

for (let i = 0; i < numbers.length; i++) {
    console.log(numbers[i]);

}
console.log('----------------------------------------------------------------------------------------------');
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

let str = ['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine', 'ten'];

for (let i = 0; i < str.length; i++) {
    console.log(str[i]);

}

console.log('----------------------------------------------------------------------------------------------');
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

let mixed = [1, 'two', 3, 'four', true, 'six', false, 9, 'nine', true];

for (const mix of mixed) {
    console.log(mix);
}


console.log('----------------------------------------------------------------------------------------------');
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

for (let i = 0; i < mixed.length; i++) {
    if (typeof(mixed[i]) === 'boolean')
        console.log(typeof(mixed[i]));
}

for (let i = 0; i < mixed.length; i++) {
    if (typeof(mixed[i]) === 'number')
        console.log(typeof(mixed[i]));
}

for (let i = 0; i < mixed.length; i++) {
    if (typeof(mixed[i]) === 'string')
        console.log(typeof(mixed[i]));
}

console.log('----------------------------------------------------------------------------------------------');
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.

arr = [];

arr[0] = false;
arr[1] = 'apple';
arr[2] = 42;
arr[3] = true;
arr[4] = null;
arr[5] = "12";
arr[6] = undefined;
arr[7] = 21;
arr[8] = 'cherry';
arr[9] = 'banana';

for (let i = 0; i < arr.length; i++) {
    console.log(arr[i]);
}

console.log('----------------------------------------------------------------------------------------------');
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

for (let i = 1; i <= 10; i++) {
    const step = 'крок: ' + i;
    console.log(step);
    document.write(step + '<br>');

}

console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

for (let i = 1; i <= 100; i++) {
    const step = 'крок: ' + i;
    console.log(step);
    document.write(step, '<br>');

}

console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
let stepTwo = 1;
for (let i = 1; i <= 100; i++) {
    const step = `крок ${i}: `;
    console.log(step, stepTwo);
    document.write(step, stepTwo, '<br>');
    stepTwo += 2;
}

console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

for (let i = 1; i <= 100; i++) {

    if (i % 2 === 0) {
        const step = 'парний крок: ' + i;
        console.log(step);
        document.write(step, '<br>');
    }

}
console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');

// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

for (let i = 1; i <= 100; i += 2) {

    const step = 'непарний крок: ' + i;
    console.log(step);
    document.write(step, '<br>');
}

// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди) 

for (let i = 0; i < 2; i++) {
    for (let j = 0; j < 60; j++) {
        console.log('хвилин ', i, ' : ', 'секунд ', j);
        document.write('хвилин ', i, ' : ', 'секунд ', j, '<br>');
    }
}

console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');
// - Відтворити роботу годинника, відрахувавши  2 години  (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)

for (let i = 0; i < 2; i++) {
    for (let j = 0; j < 60; j++) {
        for (let k = 0; k < 60; k++) {
            //document.write('годин ', i, ' : ', 'хвилин ', j, ' : ', 'секунд ', k, '<br>');
            //console.log('годин ', i, ' : ', 'хвилин ', j, ' : ', 'секунд ',);
        }
    }
}

console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');

// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.

let abc = ['a', 'b', 'c'];
let strAbc = '';
for (let i = 0; i < abc.length; i++) {
    strAbc = strAbc + abc[i];
}

console.log(strAbc);
console.log('----------------------------------------------------------------------------------------------');
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.

strAbc = '';
let i = 0;

while (i < abc.length) {
    strAbc = strAbc + abc[i];
    i++;
}
console.log(strAbc);
console.log('----------------------------------------------------------------------------------------------');

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
strAbc = '';
for (const a of abc) {
    strAbc = strAbc + a;
}

console.log(strAbc);
console.log('----------------------------------------------------------------------------------------------');
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for in зібрати всі букви в слово.

let strAbc4 = '';
for (const i in abc) {
    strAbc4 = strAbc4 + abc[i];

}

console.log(strAbc4);
console.log('----------------------------------------------------------------------------------------------');

// =================
// =================
// =================
// =================

// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
abc = ['a', 'b', 'c'];
for (let i = 1; i < 4; i++) {
    abc.push(i);
}

console.log(abc);
console.log('----------------------------------------------------------------------------------------------');
// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].

let a123 = [1, 2, 3];
let a321 = [];

for (let i = a123.length; i > 0; i--) {
    a321.push(i);
}
console.log(a321);
console.log('----------------------------------------------------------------------------------------------');
// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.

a123 = [1, 2, 3];
a123.push(4, 5, 6);

console.log(a123);

console.log('----------------------------------------------------------------------------------------------');
// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.

a123 = [1, 2, 3];
a123.unshift(4, 5, 6);

console.log(a123);
console.log('----------------------------------------------------------------------------------------------');
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()

let frontEnd = ['js', 'css', 'jq'];

let firstElement = frontEnd.shift();
console.log(firstElement);
document.write(firstElement, '<br>');

console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');
// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()

frontEnd = ['js', 'css', 'jq'];

firstElement = frontEnd.pop();
console.log(firstElement);
document.write(firstElement, '<br>');

console.log('----------------------------------------------------------------------------------------------');
document.write('---------------------------------------------------------------------------', '<br>');
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].

let arr12345 = [1, 2, 3, 4, 5];
console.log(arr12345.slice(-2));

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].

console.log(arr12345.slice(0, 2));

console.log('----------------------------------------------------------------------------------------------');
// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
arr12345 = [1, 2, 3, 4, 5];
arr12345.splice(1, 2);
console.log(arr12345);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].

arr12345 = [1, 2, 3, 4, 5];
arr12345.splice(3, 0, 'a', 'b', 'c');
console.log(arr12345);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].


arr12345 = [1, 2, 3, 4, 5];
arr12345.splice(1, 0, 'a', 'b');
arr12345.splice(6, 0, 'c');
arr12345.splice(8, 0, 'e');
console.log(arr12345);
console.log('----------------------------------------------------------------------------------------------');

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.

numbers = [10, 25, 7, 16, 12, 35, 18, 43, 4, 77];

for (let i = 0; i < numbers.length; i++) {
    const element = numbers[i];
    if (numbers[i] % 2 === 0) {
        console.log(numbers[i]);
    }
}

console.log('----------------------------------------------------------------------------------------------');
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
numbers = [10, 25, 7, 16, 12, 35, 18, 43, 4, 77];
let emptyArray = [];

for (let i = 0; i < numbers.length; i++) {
    emptyArray.push(numbers[i]);

}
console.log(emptyArray);

console.log('----------------------------------------------------------------------------------------------');
// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.

numbers = [10, 25, 7, 16, 12, 35, 18, 43, 4, 77];
emptyArray = [];

for (const number in numbers) {
    console.log(number);
    emptyArray[number] = numbers[number];
}

console.log(emptyArray);

console.log('----------------------------------------------------------------------------------------------');
// ============

// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:

numbers = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

// 1. перебрати його циклом while

i = 0;

while (i < numbers.length) {
    console.log(numbers[i]);
    i++;
}
console.log('--------------------------------');
// 2. перебрати його циклом for

for (let i = 0; i < numbers.length; i++) {
    console.log(numbers[i]);
}

console.log('--------------------------------');
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом

i = 1;
while (i < numbers.length) {
    console.log(i, numbers[i]);
    i += 2;
}
console.log('--------------------------------');
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

for (let i = 1; i < numbers.length; i += 2) {
    console.log(i, numbers[i]);
}

console.log('--------------------------------');

// 5. перебрати циклом while та вивести  числа тільки парні  значення

i = 0;
while (i < numbers.length) {

    if (numbers[i] % 2 === 0) {

        console.log(numbers[i]);
    }
    i++;
}
console.log('--------------------------------');

// 6. перебрати циклом for та вивести  числа тільки парні  значення

for (let i = 0; i < numbers.length; i++) {
    if (numbers[i] % 2 === 0) {

        console.log(numbers[i]);
    }
}

console.log('--------------------------------');

// 7. замінити кожне число кратне 3 на слово "okten"

for (let i = 0; i < numbers.length; i++) {
    if (numbers[i] % 3 === 0) {
        numbers[i] = 'okten';
    }
}
console.log(numbers);
console.log('--------------------------------');

// 8. вивести масив в зворотньому порядку.

numbers = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

console.log(numbers.reverse());
console.log('--------------------------------');
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// 9.1. перебрати його циклом while
numbers = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

i = numbers.length;

while (i > 0) {
    i--;
    console.log(numbers[i]);

}
console.log('--------------------------------');
// 9.2. перебрати його циклом for

for (let i = numbers.length - 1; i > 0; i--) {
    console.log(numbers[i]);
}

console.log('--------------------------------');
// 9.3. перебрати циклом while та вивести  числа тільки з непарним індексом

i = numbers.length - 1;
while (i >= 1) {
    console.log(i, numbers[i]);
    i -= 2;
}
console.log('--------------------------------');
// 9.4. перебрати циклом for та вивести  числа тільки з непарним індексом

for (let i = numbers.length - 1; i >= 1; i -= 2) {
    console.log(i, numbers[i]);
}

console.log('--------------------------------');

// 9.5. перебрати циклом while та вивести  числа тільки парні  значення

i = numbers.length - 2;
while (i >= 0) {
    if (numbers[i] % 2 === 0) {

        console.log(numbers[i]);
    }
    i--;
}
console.log('--------------------------------');

// 9.6. перебрати циклом for та вивести  числа тільки парні  значення

for (let i = numbers.length - 2; i >= 0; i--) {
    if (numbers[i] % 2 === 0) {

        console.log(numbers[i]);
    }
}

console.log('--------------------------------');

// 9.7. замінити кожне число кратне 3 на слово "okten"

for (let i = numbers.length; i >= 0; i--) {
    if (numbers[i] % 3 === 0) {
        numbers[i] = 'okten';
    }

}
console.log(numbers.reverse());
console.log('--------------------------------');

// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
emptyArray = [];

for (let i = 0; i < 50; i++) {
    if (i % 2 === 0) {
        emptyArray[i] = i;
    } else {
        emptyArray[i] = i + 1;
    }
}
console.log(emptyArray);
console.log('--------------------------------');
// - заповнити його 50 непарними числами за допомоги циклу.

emptyArray = [];

for (let i = 0; i < 50; i++) {
    if (!(i % 2 === 0)) {
        emptyArray[i] = i;
    } else {
        emptyArray[i] = i + 1;
    }
}
console.log(emptyArray);
console.log('--------------------------------');

// 1
//  створити пустий масив та :

emptyArray = [];

// 2. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)

//2.1
let rundomNumber = Math.round((Math.random() * 100));
console.log(rundomNumber);

for (let i = 0; i < rundomNumber; i++) {
    emptyArray[i] = Math.round((Math.random() * 100));
}
console.log(emptyArray);

//2.2

emptyArray = [];
let min = 8;
let max = 732;
rundomNumber = Math.round(Math.random() * (max - min)) + min;
console.log(rundomNumber);

for (let i = 0; i < rundomNumber; i++) {
    emptyArray[i] = Math.round(Math.random() * (max - min)) + min;
}
console.log(emptyArray);
console.log('--------------------------------');
//  3. вывести на консоль  каждый третий елемент

for (let i = 2; i < emptyArray.length; i += 3) {
    console.log(emptyArray[i]);
}
console.log('--------------------------------');
//  4. вывести на консоль  каждый третий елемент но при условии что его значение является парным.
//  5. вывести на консоль  каждый третий елемент но при условии что он имеет парное значение и записать их в другой массив.

let anotherArray = [];

for (let i = 2; i < emptyArray.length; i += 3) {
    if (emptyArray[i] % 2 === 0) {

        console.log(emptyArray[i]);
        anotherArray.push(emptyArray[i]);
    }
}
console.log(anotherArray);
console.log('--------------------------------');

//  6. Вывести каждый елемент массива у которого соседний с права элемент - парный

for (let i = 0; i < emptyArray.length; i++) {
    if (emptyArray[i] % 2 === 0) {

        console.log('елемент', emptyArray[i - 1]);
        console.log('сусідній справа', emptyArray[i]);
    }

}
console.log('--------------------------------');

//  7 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.

numbers = [100, 250, 50, 168, 120, 345, 188];
let sum = 0;

for (let i = 0; i < numbers.length; i++) {
    const element = numbers[i];
    sum = sum + element;
}

let middle = sum / numbers.length;
console.log(middle);
console.log('--------------------------------');
// 8 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.

numbers = [5, 12, 10, 42, 100, 21, 75, 52, 31];
anotherArray = [];

for (let i = 0; i < numbers.length; i++) {
    anotherArray.push(numbers[i] * 5);
}
console.log(numbers);
console.log(anotherArray);
console.log('--------------------------------');
// 9 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
//  додати його в інший масив.

arr = [5, '12', 10, true, 42, '100', 21, false, 75, '52', 31];
anotherArray = [];

for (let i = 0; i < arr.length; i++) {

    if (typeof(arr[i]) === 'number') {
        anotherArray.push(arr[i]);
    }
}
console.log(arr);
console.log(anotherArray);